*** Javascript
 #+BEGIN_SRC emacs-lisp
;; (load-org "js.org")

 #+END_SRC

 #+RESULTS:
 : Loaded /home/paul/.emacs.d/js.el

*** [[./org.org][org]]
 #+BEGIN_SRC emacs-lisp
   (load-org "org.org")
 #+END_SRC

 #+RESULTS:
 : Loaded ~/.emacs.d/org.el

*** web
 #+BEGIN_SRC emacs-lisp
 (use-package rainbow-mode :ensure t)

 ;; (use-package web-mode :ensure t)

 (dolist (m '(web-mode))
   (add-hook m (lambda () (hexcolour-mode 1))))

 (defun my-web-mode-hook ()
   "Hooks for Web mode."
   (let ((offset 2))
     (setq web-mode-markup-indent-offset offset
           web-mode-css-indent-offset    offset
           web-mode-code-indent-offset   offset
           ))
   (whitespace-mode -1)
   (rainbow-mode 1))

 (add-hook 'web-mode-hook 'my-web-mode-hook)
 (add-hook 'css-mode-hook 'my-web-mode-hook)

 (push '("\\.html$" . web-mode) auto-mode-alist)
 (push '("\\.rdf$"  . web-mode) auto-mode-alist)

 ;; Validation is slow in big xml files, default to off
 (setq rng-nxml-auto-validate-flag nil)
 (add-hook 'nxml-mode-hook
           (defun my-nxml-validate-hook ()
             (when (< (buffer-size) 9000000)
               (rng-validate-mode 1))))

 ;; https://emacs.stackexchange.com/questions/20016/no-html-jsx-indentation-in-jsx-mode
 ;; (add-hook 'web-mode-hook
 ;;           (lambda ()
 ;;             ;; short circuit js mode and just do everything in jsx-mode
 ;;             (if (equal web-mode-content-type "javascript")
 ;;                 ;; (web-mode-set-content-type "jsx")
 ;;               (message "now set to: %s" web-mode-content-type))))
 #+END_SRC

 #+RESULTS:
 | my-nxml-validate-hook |

*** Browsing
 #+BEGIN_SRC emacs-lisp
   (setq-default browse-url-browser-function
                 '(;; ("path/to/media/hypertext" . eww-browse-url)
                   ("." . browse-url-chrome))
                 browse-url-chrome "/opt/google/chrome"
                 browse-url-new-window-flag t
                 shr-external-browser 'browse-url-firefox
                 eww-download-directory "~/tmp/")
 #+END_SRC

 #+RESULTS:
 : ~/tmp/

*** Disable abbrev mode
#+BEGIN_SRC emacs-lisp
(abbrev-mode -1)
(setq abbrev-file-name "~/.emacs.d/.abbrev_defs")
#+END_SRC

#+RESULTS:
: ~/.emacs.d/abbrev_defs
*** Mu4e compose mode
When writing emails, turn off auto-fill mode
#+BEGIN_SRC emacs-lisp
;; (add-hook `after-change-major-mode-hook `my-after-change-major-mode-prog-mode)
;; (defun my-after-change-major-mode-prog-mode ()
;;   "Custom `after-change-major-mode-hook' behaviours."
;;   ;; (when (derived-mode-p `mu4e-compose-mode-hook)
;;   ;;   (lambda ()
;;   ;;                                   (message "JAWEL here")
;;   ;;                                   (auto-fill-mode -1)
;;   ;;                                   (visual-line-mode)))
;;   )
  (add-hook 'mu4e-compose-mode-hook (lambda ()
                                    (message "JAWEL") ;; (setq
                                                      ;;  `auto-fill-function t)
                                    (auto-fill-mode -1)
                                    (visual-line-mode)))


#+END_SRC

#+RESULTS:
| lambda | nil | (message JAWEL) | (setq (` auto-fill-function) t)     | (auto-fill-mode -1) | (visual-line-mode) |
| lambda | nil | (message JAWEL) | (setq (quote auto-fill-function) t) | (auto-fill-mode -1) | (visual-line-mode) |

